virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/atsama5d27.h
/**
 * \brief Header file for ATSAMA5D27
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-05-04T06:27:24Z */
#ifndef _SAMA5D27_H_
#define _SAMA5D27_H_

// Header version uses Semantic Versioning 2.0.0 (https://semver.org/)
#define HEADER_FORMAT_VERSION "2.0.0"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (0)

/** \addtogroup SAMA5D27_definitions SAMA5D27 definitions
  This file defines all structures and symbols for SAMA5D27:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_U_) || defined(_L_) || defined(_UL_)
#    error "Integer Literals macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#  define _U_(x) (x ## U)    /**< C code: Unsigned integer literal constant value */
#  define _L_(x) (x ## L)    /**< C code: Long integer literal constant value */
#  define _UL_(x) (x ## UL)  /**< C code: Unsigned Long integer literal constant value */

#else /* Assembler */

#  define _U_(x) x    /**< Assembler: Unsigned integer literal constant value */
#  define _L_(x) x    /**< Assembler: Long integer literal constant value */
#  define _UL_(x) x   /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */
/** @}  end of Atmel Global Defines */

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAMA5D27                                           */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-A5 Processor Exceptions Numbers ******************************/
/******  SAMA5D27 specific Interrupt Numbers ***********************************/
  SAIC_IRQn                 =   0, /**< 0   Advanced Interrupt Controller (SAIC) */
  PMU_IRQn                  =   2, /**< 2   PMU (PMU)                           */
  PIT_IRQn                  =   3, /**< 3   Periodic Interval Timer (PIT)       */
  WDT_IRQn                  =   4, /**< 4   Watchdog Timer (WDT)                */
  GMAC_IRQn                 =   5, /**< 5   Gigabit Ethernet MAC (GMAC)         */
  XDMAC0_IRQn               =   6, /**< 6   Extensible DMA Controller (XDMAC0)  */
  XDMAC1_IRQn               =   7, /**< 7   Extensible DMA Controller (XDMAC1)  */
  ICM_IRQn                  =   8, /**< 8   Integrity Check Monitor (ICM)       */
  AES_IRQn                  =   9, /**< 9   Advanced Encryption Standard (AES)  */
  AESB_IRQn                 =  10, /**< 10  Advanced Encryption Standard Bridge (AESB) */
  TDES_IRQn                 =  11, /**< 11  Triple Data Encryption Standard (TDES) */
  SHA_IRQn                  =  12, /**< 12  Secure Hash Algorithm (SHA)         */
  MPDDRC_IRQn               =  13, /**< 13  AHB Multiport DDR-SDRAM Controller (MPDDRC) */
  MATRIX1_IRQn              =  14, /**< 14  AHB Bus Matrix (MATRIX1)            */
  MATRIX0_IRQn              =  15, /**< 15  AHB Bus Matrix (MATRIX0)            */
  SECUMOD_IRQn              =  16, /**< 16  Security Module (SECUMOD)           */
  HSMC_IRQn                 =  17, /**< 17  HSMC (HSMC)                         */
  PIOA_IRQn                 =  18, /**< 18  Parallel Input/Output Controller (PIOA) */
  FLEXCOM0_IRQn             =  19, /**< 19  Flexible Serial Communication (FLEXCOM0) */
  FLEXCOM1_IRQn             =  20, /**< 20  Flexible Serial Communication (FLEXCOM1) */
  FLEXCOM2_IRQn             =  21, /**< 21  Flexible Serial Communication (FLEXCOM2) */
  FLEXCOM3_IRQn             =  22, /**< 22  Flexible Serial Communication (FLEXCOM3) */
  FLEXCOM4_IRQn             =  23, /**< 23  Flexible Serial Communication (FLEXCOM4) */
  UART0_IRQn                =  24, /**< 24  Universal Asynchronous Receiver Transmitter (UART0) */
  UART1_IRQn                =  25, /**< 25  Universal Asynchronous Receiver Transmitter (UART1) */
  UART2_IRQn                =  26, /**< 26  Universal Asynchronous Receiver Transmitter (UART2) */
  UART3_IRQn                =  27, /**< 27  Universal Asynchronous Receiver Transmitter (UART3) */
  UART4_IRQn                =  28, /**< 28  Universal Asynchronous Receiver Transmitter (UART4) */
  TWIHS0_IRQn               =  29, /**< 29  Two-wire Interface High Speed (TWIHS0) */
  TWIHS1_IRQn               =  30, /**< 30  Two-wire Interface High Speed (TWIHS1) */
  SDMMC0_IRQn               =  31, /**< 31  Secure Digital MultiMedia Card Controller (SDMMC0) */
  SDMMC1_IRQn               =  32, /**< 32  Secure Digital MultiMedia Card Controller (SDMMC1) */
  SPI0_IRQn                 =  33, /**< 33  Serial Peripheral Interface (SPI0)  */
  SPI1_IRQn                 =  34, /**< 34  Serial Peripheral Interface (SPI1)  */
  TC0_IRQn                  =  35, /**< 35  Timer Counter (TC0)                 */
  TC1_IRQn                  =  36, /**< 36  Timer Counter (TC1)                 */
  PWM_IRQn                  =  38, /**< 38  Pulse Width Modulation Controller (PWM) */
  ADC_IRQn                  =  40, /**< 40  Analog-to-Digital Converter (ADC)   */
  UHPHS_IRQn                =  41, /**< 41  UHPHS (UHPHS)                       */
  UDPHS_IRQn                =  42, /**< 42  USB High Speed Device Port (UDPHS)  */
  SSC0_IRQn                 =  43, /**< 43  Synchronous Serial Controller (SSC0) */
  SSC1_IRQn                 =  44, /**< 44  Synchronous Serial Controller (SSC1) */
  LCDC_IRQn                 =  45, /**< 45  LCD Controller (LCDC)               */
  ISC_IRQn                  =  46, /**< 46  Image Sensor Controller (ISC)       */
  TRNG_IRQn                 =  47, /**< 47  True Random Number Generator (TRNG) */
  PDMIC_IRQn                =  48, /**< 48  Pulse Density Modulation Interface Controller (PDMIC) */
  AIC_IRQn                  =  49, /**< 49  Advanced Interrupt Controller (AIC) */
  SFC_IRQn                  =  50, /**< 50  Secure Fuse Controller (SFC)        */
  SECURAM_IRQn              =  51, /**< 51  SECURAM (SECURAM)                   */
  QSPI0_IRQn                =  52, /**< 52  Quad Serial Peripheral Interface (QSPI0) */
  QSPI1_IRQn                =  53, /**< 53  Quad Serial Peripheral Interface (QSPI1) */
  I2SC0_IRQn                =  54, /**< 54  Inter-IC Sound Controller (I2SC0)   */
  I2SC1_IRQn                =  55, /**< 55  Inter-IC Sound Controller (I2SC1)   */
  MCAN0_INT0_IRQn           =  56, /**< 56  Controller Area Network (MCAN0)     */
  MCAN1_INT0_IRQn           =  57, /**< 57  Controller Area Network (MCAN1)     */
  PTC_IRQn                  =  58, /**< 58  Peripheral Touch Controller (PTC)   */
  CLASSD_IRQn               =  59, /**< 59  Audio Class D Amplifier (CLASSD) (CLASSD) */
  L2CC_IRQn                 =  63, /**< 63  L2 Cache Controller (L2CC)          */
  MCAN0_INT1_IRQn           =  64, /**< 64  Controller Area Network (MCAN0)     */
  MCAN1_INT1_IRQn           =  65, /**< 65  Controller Area Network (MCAN1)     */
  GMAC_Q1_IRQn              =  66, /**< 66  Gigabit Ethernet MAC (GMAC)         */
  GMAC_Q2_IRQn              =  67, /**< 67  Gigabit Ethernet MAC (GMAC)         */
  PIOB_IRQn                 =  68, /**< 68  Parallel Input/Output Controller (PIOB) */
  PIOC_IRQn                 =  69, /**< 69  Parallel Input/Output Controller (PIOC) */
  PIOD_IRQn                 =  70, /**< 70  Parallel Input/Output Controller (PIOD) */
  SDMMC0_TIMER_IRQn         =  71, /**< 71  Secure Digital MultiMedia Card Controller (SDMMC0) */
  SDMMC1_TIMER_IRQn         =  72, /**< 72  Secure Digital MultiMedia Card Controller (SDMMC1) */
  RSTC_IRQn                 =  74, /**< 74  Shared between PMC RSTC RTC (RSTC)  */
  RTC_IRQn                  =  74, /**< 74  Shared between PMC RSTC RTC (RTC)   */
  PMC_IRQn                  =  74, /**< 74  Shared between PMC RSTC RTC (PMC)   */
  ACC_IRQn                  =  75, /**< 75  Analog Comparator Controller (ACC)  */
  RXLP_IRQn                 =  76, /**< 76  Low Power Asynchronous Receiver (RXLP) */

  PERIPH_MAX_IRQn           =  76  /**< Max peripheral ID */
} IRQn_Type;
